app/controllers/schools_controller.rb

  def index
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def show
    @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def support
    @school = School.find_by_id(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 26], ["LIMIT", 1]]