app/controllers/students_controller.rb

  def show
    @student = Student.find_by_id(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def new
    @student = Student.new
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    student = Student.new(student_params)
    student.name = student.name.titlecase
    student.save
---
INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "Aaron"], ["age", 22], ["created_at", "2019-11-22 19:09:33.926496"], ["updated_at", "2019-11-22 19:09:33.926496"], ["school_id", 28]]

  def edit
    @student = Student.find_by_id(params[:id])
    @schools = School.all
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "schools".* FROM "schools"

  def update
    student = Student.find_by_id(params[:id])
    student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 28], ["school_id", 30], ["updated_at", "2019-11-22 18:26:45.883184"], ["id", 8]]

  def delete
   student = Student.find_by_id(params[:id])
   school = student.school
   student.destroy
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 10]]